GopalSaraf/Practicals/PSDL/include/proc/pic16f1789.inc
// Register: PSMC2POL
#define PSMC2POL PSMC2POL
PSMC2POL                                 equ 0EB6h
// bitfield definitions
PSMC2POL_P2POLA_POSN                     equ 0000h
PSMC2POL_P2POLA_POSITION                 equ 0000h
PSMC2POL_P2POLA_SIZE                     equ 0001h
PSMC2POL_P2POLA_LENGTH                   equ 0001h
PSMC2POL_P2POLA_MASK                     equ 0001h
PSMC2POL_P2POLB_POSN                     equ 0001h
PSMC2POL_P2POLB_POSITION                 equ 0001h
PSMC2POL_P2POLB_SIZE                     equ 0001h
PSMC2POL_P2POLB_LENGTH                   equ 0001h
PSMC2POL_P2POLB_MASK                     equ 0002h
PSMC2POL_P2INPOL_POSN                    equ 0006h
PSMC2POL_P2INPOL_POSITION                equ 0006h
PSMC2POL_P2INPOL_SIZE                    equ 0001h
PSMC2POL_P2INPOL_LENGTH                  equ 0001h
PSMC2POL_P2INPOL_MASK                    equ 0040h

// Register: PSMC2BLNK
#define PSMC2BLNK PSMC2BLNK
PSMC2BLNK                                equ 0EB7h
// bitfield definitions
PSMC2BLNK_P2REBM_POSN                    equ 0000h
PSMC2BLNK_P2REBM_POSITION                equ 0000h
PSMC2BLNK_P2REBM_SIZE                    equ 0002h
PSMC2BLNK_P2REBM_LENGTH                  equ 0002h
PSMC2BLNK_P2REBM_MASK                    equ 0003h
PSMC2BLNK_P2FEBM_POSN                    equ 0004h
PSMC2BLNK_P2FEBM_POSITION                equ 0004h
PSMC2BLNK_P2FEBM_SIZE                    equ 0002h
PSMC2BLNK_P2FEBM_LENGTH                  equ 0002h
PSMC2BLNK_P2FEBM_MASK                    equ 0030h
PSMC2BLNK_P2REBM0_POSN                   equ 0000h
PSMC2BLNK_P2REBM0_POSITION               equ 0000h
PSMC2BLNK_P2REBM0_SIZE                   equ 0001h
PSMC2BLNK_P2REBM0_LENGTH                 equ 0001h
PSMC2BLNK_P2REBM0_MASK                   equ 0001h
PSMC2BLNK_P2REBM1_POSN                   equ 0001h
PSMC2BLNK_P2REBM1_POSITION               equ 0001h
PSMC2BLNK_P2REBM1_SIZE                   equ 0001h
PSMC2BLNK_P2REBM1_LENGTH                 equ 0001h
PSMC2BLNK_P2REBM1_MASK                   equ 0002h
PSMC2BLNK_P2FEBM0_POSN                   equ 0004h
PSMC2BLNK_P2FEBM0_POSITION               equ 0004h
PSMC2BLNK_P2FEBM0_SIZE                   equ 0001h
PSMC2BLNK_P2FEBM0_LENGTH                 equ 0001h
PSMC2BLNK_P2FEBM0_MASK                   equ 0010h
PSMC2BLNK_P2FEBM1_POSN                   equ 0005h
PSMC2BLNK_P2FEBM1_POSITION               equ 0005h
PSMC2BLNK_P2FEBM1_SIZE                   equ 0001h
PSMC2BLNK_P2FEBM1_LENGTH                 equ 0001h
PSMC2BLNK_P2FEBM1_MASK                   equ 0020h

// Register: PSMC2REBS
#define PSMC2REBS PSMC2REBS
PSMC2REBS                                equ 0EB8h
// bitfield definitions
PSMC2REBS_P2REBSC1_POSN                  equ 0001h
PSMC2REBS_P2REBSC1_POSITION              equ 0001h
PSMC2REBS_P2REBSC1_SIZE                  equ 0001h
PSMC2REBS_P2REBSC1_LENGTH                equ 0001h
PSMC2REBS_P2REBSC1_MASK                  equ 0002h
PSMC2REBS_P2REBSC2_POSN                  equ 0002h
PSMC2REBS_P2REBSC2_POSITION              equ 0002h
PSMC2REBS_P2REBSC2_SIZE                  equ 0001h
PSMC2REBS_P2REBSC2_LENGTH                equ 0001h
PSMC2REBS_P2REBSC2_MASK                  equ 0004h
PSMC2REBS_P2REBSC3_POSN                  equ 0003h
PSMC2REBS_P2REBSC3_POSITION              equ 0003h
PSMC2REBS_P2REBSC3_SIZE                  equ 0001h
PSMC2REBS_P2REBSC3_LENGTH                equ 0001h
PSMC2REBS_P2REBSC3_MASK                  equ 0008h
PSMC2REBS_P2REBSC4_POSN                  equ 0004h
PSMC2REBS_P2REBSC4_POSITION              equ 0004h
PSMC2REBS_P2REBSC4_SIZE                  equ 0001h
PSMC2REBS_P2REBSC4_LENGTH                equ 0001h
PSMC2REBS_P2REBSC4_MASK                  equ 0010h
PSMC2REBS_P2REBSIN_POSN                  equ 0007h
PSMC2REBS_P2REBSIN_POSITION              equ 0007h
PSMC2REBS_P2REBSIN_SIZE                  equ 0001h
PSMC2REBS_P2REBSIN_LENGTH                equ 0001h
PSMC2REBS_P2REBSIN_MASK                  equ 0080h

// Register: PSMC2FEBS
#define PSMC2FEBS PSMC2FEBS
PSMC2FEBS                                equ 0EB9h
// bitfield definitions
PSMC2FEBS_P2FEBSC1_POSN                  equ 0001h
PSMC2FEBS_P2FEBSC1_POSITION              equ 0001h
PSMC2FEBS_P2FEBSC1_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSC1_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSC1_MASK                  equ 0002h
PSMC2FEBS_P2FEBSC2_POSN                  equ 0002h
PSMC2FEBS_P2FEBSC2_POSITION              equ 0002h
PSMC2FEBS_P2FEBSC2_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSC2_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSC2_MASK                  equ 0004h
PSMC2FEBS_P2FEBSC3_POSN                  equ 0003h
PSMC2FEBS_P2FEBSC3_POSITION              equ 0003h
PSMC2FEBS_P2FEBSC3_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSC3_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSC3_MASK                  equ 0008h
PSMC2FEBS_P2FEBSC4_POSN                  equ 0004h
PSMC2FEBS_P2FEBSC4_POSITION              equ 0004h
PSMC2FEBS_P2FEBSC4_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSC4_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSC4_MASK                  equ 0010h
PSMC2FEBS_P2FEBSIN_POSN                  equ 0007h
PSMC2FEBS_P2FEBSIN_POSITION              equ 0007h
PSMC2FEBS_P2FEBSIN_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSIN_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSIN_MASK                  equ 0080h

// Register: PSMC2PHS
#define PSMC2PHS PSMC2PHS
PSMC2PHS                                 equ 0EBAh
// bitfield definitions
PSMC2PHS_P2PHST_POSN                     equ 0000h
PSMC2PHS_P2PHST_POSITION                 equ 0000h
PSMC2PHS_P2PHST_SIZE                     equ 0001h
PSMC2PHS_P2PHST_LENGTH                   equ 0001h
PSMC2PHS_P2PHST_MASK                     equ 0001h
PSMC2PHS_P2PHSC1_POSN                    equ 0001h
PSMC2PHS_P2PHSC1_POSITION                equ 0001h
PSMC2PHS_P2PHSC1_SIZE                    equ 0001h
PSMC2PHS_P2PHSC1_LENGTH                  equ 0001h
PSMC2PHS_P2PHSC1_MASK                    equ 0002h
PSMC2PHS_P2PHSC2_POSN                    equ 0002h
PSMC2PHS_P2PHSC2_POSITION                equ 0002h
PSMC2PHS_P2PHSC2_SIZE                    equ 0001h
PSMC2PHS_P2PHSC2_LENGTH                  equ 0001h
PSMC2PHS_P2PHSC2_MASK                    equ 0004h
PSMC2PHS_P2PHSC3_POSN                    equ 0003h
PSMC2PHS_P2PHSC3_POSITION                equ 0003h
PSMC2PHS_P2PHSC3_SIZE                    equ 0001h
PSMC2PHS_P2PHSC3_LENGTH                  equ 0001h
PSMC2PHS_P2PHSC3_MASK                    equ 0008h
PSMC2PHS_P2PHSC4_POSN                    equ 0004h
PSMC2PHS_P2PHSC4_POSITION                equ 0004h
PSMC2PHS_P2PHSC4_SIZE                    equ 0001h
PSMC2PHS_P2PHSC4_LENGTH                  equ 0001h
PSMC2PHS_P2PHSC4_MASK                    equ 0010h
PSMC2PHS_P2PHSIN_POSN                    equ 0007h
PSMC2PHS_P2PHSIN_POSITION                equ 0007h
PSMC2PHS_P2PHSIN_SIZE                    equ 0001h
PSMC2PHS_P2PHSIN_LENGTH                  equ 0001h
PSMC2PHS_P2PHSIN_MASK                    equ 0080h

// Register: PSMC2DCS
#define PSMC2DCS PSMC2DCS
PSMC2DCS                                 equ 0EBBh
// bitfield definitions
PSMC2DCS_P2DCST_POSN                     equ 0000h
PSMC2DCS_P2DCST_POSITION                 equ 0000h
PSMC2DCS_P2DCST_SIZE                     equ 0001h
PSMC2DCS_P2DCST_LENGTH                   equ 0001h
PSMC2DCS_P2DCST_MASK                     equ 0001h
PSMC2DCS_P2DCSC1_POSN                    equ 0001h
PSMC2DCS_P2DCSC1_POSITION                equ 0001h
PSMC2DCS_P2DCSC1_SIZE                    equ 0001h
PSMC2DCS_P2DCSC1_LENGTH                  equ 0001h
PSMC2DCS_P2DCSC1_MASK                    equ 0002h
PSMC2DCS_P2DCSC2_POSN                    equ 0002h
PSMC2DCS_P2DCSC2_POSITION                equ 0002h
PSMC2DCS_P2DCSC2_SIZE                    equ 0001h
PSMC2DCS_P2DCSC2_LENGTH                  equ 0001h
PSMC2DCS_P2DCSC2_MASK                    equ 0004h
PSMC2DCS_P2DCSC3_POSN                    equ 0003h
PSMC2DCS_P2DCSC3_POSITION                equ 0003h
PSMC2DCS_P2DCSC3_SIZE                    equ 0001h
PSMC2DCS_P2DCSC3_LENGTH                  equ 0001h
PSMC2DCS_P2DCSC3_MASK                    equ 0008h
PSMC2DCS_P2DCSC4_POSN                    equ 0004h
PSMC2DCS_P2DCSC4_POSITION                equ 0004h
PSMC2DCS_P2DCSC4_SIZE                    equ 0001h
PSMC2DCS_P2DCSC4_LENGTH                  equ 0001h
PSMC2DCS_P2DCSC4_MASK                    equ 0010h
PSMC2DCS_P2DCSIN_POSN                    equ 0007h
PSMC2DCS_P2DCSIN_POSITION                equ 0007h
PSMC2DCS_P2DCSIN_SIZE                    equ 0001h
PSMC2DCS_P2DCSIN_LENGTH                  equ 0001h
PSMC2DCS_P2DCSIN_MASK                    equ 0080h

// Register: PSMC2PRS
#define PSMC2PRS PSMC2PRS
PSMC2PRS                                 equ 0EBCh
// bitfield definitions
PSMC2PRS_P2PRST_POSN                     equ 0000h
PSMC2PRS_P2PRST_POSITION                 equ 0000h
PSMC2PRS_P2PRST_SIZE                     equ 0001h
PSMC2PRS_P2PRST_LENGTH                   equ 0001h
PSMC2PRS_P2PRST_MASK                     equ 0001h
PSMC2PRS_P2PRSC1_POSN                    equ 0001h
PSMC2PRS_P2PRSC1_POSITION                equ 0001h
PSMC2PRS_P2PRSC1_SIZE                    equ 0001h
PSMC2PRS_P2PRSC1_LENGTH                  equ 0001h
PSMC2PRS_P2PRSC1_MASK                    equ 0002h
PSMC2PRS_P2PRSC2_POSN                    equ 0002h
PSMC2PRS_P2PRSC2_POSITION                equ 0002h
PSMC2PRS_P2PRSC2_SIZE                    equ 0001h
PSMC2PRS_P2PRSC2_LENGTH                  equ 0001h
PSMC2PRS_P2PRSC2_MASK                    equ 0004h
PSMC2PRS_P2PRSC3_POSN                    equ 0003h
PSMC2PRS_P2PRSC3_POSITION                equ 0003h
PSMC2PRS_P2PRSC3_SIZE                    equ 0001h
PSMC2PRS_P2PRSC3_LENGTH                  equ 0001h
PSMC2PRS_P2PRSC3_MASK                    equ 0008h
PSMC2PRS_P2PRSC4_POSN                    equ 0004h
PSMC2PRS_P2PRSC4_POSITION                equ 0004h
PSMC2PRS_P2PRSC4_SIZE                    equ 0001h
PSMC2PRS_P2PRSC4_LENGTH                  equ 0001h
PSMC2PRS_P2PRSC4_MASK                    equ 0010h
PSMC2PRS_P2PRSIN_POSN                    equ 0007h
PSMC2PRS_P2PRSIN_POSITION                equ 0007h
PSMC2PRS_P2PRSIN_SIZE                    equ 0001h
PSMC2PRS_P2PRSIN_LENGTH                  equ 0001h
PSMC2PRS_P2PRSIN_MASK                    equ 0080h

// Register: PSMC2ASDC
#define PSMC2ASDC PSMC2ASDC
PSMC2ASDC                                equ 0EBDh
// bitfield definitions
PSMC2ASDC_P2ASDOV_POSN                   equ 0000h
PSMC2ASDC_P2ASDOV_POSITION               equ 0000h
PSMC2ASDC_P2ASDOV_SIZE                   equ 0001h
PSMC2ASDC_P2ASDOV_LENGTH                 equ 0001h
PSMC2ASDC_P2ASDOV_MASK                   equ 0001h
PSMC2ASDC_P2ARSEN_POSN                   equ 0005h
PSMC2ASDC_P2ARSEN_POSITION               equ 0005h
PSMC2ASDC_P2ARSEN_SIZE                   equ 0001h
PSMC2ASDC_P2ARSEN_LENGTH                 equ 0001h
PSMC2ASDC_P2ARSEN_MASK                   equ 0020h
PSMC2ASDC_P2ASDEN_POSN                   equ 0006h
PSMC2ASDC_P2ASDEN_POSITION               equ 0006h
PSMC2ASDC_P2ASDEN_SIZE                   equ 0001h
PSMC2ASDC_P2ASDEN_LENGTH                 equ 0001h
PSMC2ASDC_P2ASDEN_MASK                   equ 0040h
PSMC2ASDC_P2ASE_POSN                     equ 0007h
PSMC2ASDC_P2ASE_POSITION                 equ 0007h
PSMC2ASDC_P2ASE_SIZE                     equ 0001h
PSMC2ASDC_P2ASE_LENGTH                   equ 0001h
PSMC2ASDC_P2ASE_MASK                     equ 0080h

// Register: PSMC2ASDL
#define PSMC2ASDL PSMC2ASDL
PSMC2ASDL                                equ 0EBEh
// bitfield definitions
PSMC2ASDL_P2ASDLA_POSN                   equ 0000h
PSMC2ASDL_P2ASDLA_POSITION               equ 0000h
PSMC2ASDL_P2ASDLA_SIZE                   equ 0001h
PSMC2ASDL_P2ASDLA_LENGTH                 equ 0001h
PSMC2ASDL_P2ASDLA_MASK                   equ 0001h
PSMC2ASDL_P2ASDLB_POSN                   equ 0001h
PSMC2ASDL_P2ASDLB_POSITION               equ 0001h
PSMC2ASDL_P2ASDLB_SIZE                   equ 0001h
PSMC2ASDL_P2ASDLB_LENGTH                 equ 0001h
PSMC2ASDL_P2ASDLB_MASK                   equ 0002h

// Register: PSMC2ASDS
#define PSMC2ASDS PSMC2ASDS
PSMC2ASDS                                equ 0EBFh
// bitfield definitions
PSMC2ASDS_P2ASDSC1_POSN                  equ 0001h
PSMC2ASDS_P2ASDSC1_POSITION              equ 0001h
PSMC2ASDS_P2ASDSC1_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSC1_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSC1_MASK                  equ 0002h
PSMC2ASDS_P2ASDSC2_POSN                  equ 0002h
PSMC2ASDS_P2ASDSC2_POSITION              equ 0002h
PSMC2ASDS_P2ASDSC2_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSC2_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSC2_MASK                  equ 0004h
PSMC2ASDS_P2ASDSC3_POSN                  equ 0003h
PSMC2ASDS_P2ASDSC3_POSITION              equ 0003h
PSMC2ASDS_P2ASDSC3_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSC3_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSC3_MASK                  equ 0008h
PSMC2ASDS_P2ASDSC4_POSN                  equ 0004h
PSMC2ASDS_P2ASDSC4_POSITION              equ 0004h
PSMC2ASDS_P2ASDSC4_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSC4_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSC4_MASK                  equ 0010h
PSMC2ASDS_P2ASDSIN_POSN                  equ 0007h
PSMC2ASDS_P2ASDSIN_POSITION              equ 0007h
PSMC2ASDS_P2ASDSIN_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSIN_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSIN_MASK                  equ 0080h

