GopalSaraf/Practicals/PSDL/include/proc/pic16f1789.inc
// Register: PSMC4MDL
#define PSMC4MDL PSMC4MDL
PSMC4MDL                                 equ 0F12h
// bitfield definitions
PSMC4MDL_P4MSRC_POSN                     equ 0000h
PSMC4MDL_P4MSRC_POSITION                 equ 0000h
PSMC4MDL_P4MSRC_SIZE                     equ 0004h
PSMC4MDL_P4MSRC_LENGTH                   equ 0004h
PSMC4MDL_P4MSRC_MASK                     equ 000Fh
PSMC4MDL_P4MDLBIT_POSN                   equ 0005h
PSMC4MDL_P4MDLBIT_POSITION               equ 0005h
PSMC4MDL_P4MDLBIT_SIZE                   equ 0001h
PSMC4MDL_P4MDLBIT_LENGTH                 equ 0001h
PSMC4MDL_P4MDLBIT_MASK                   equ 0020h
PSMC4MDL_P4MDLPOL_POSN                   equ 0006h
PSMC4MDL_P4MDLPOL_POSITION               equ 0006h
PSMC4MDL_P4MDLPOL_SIZE                   equ 0001h
PSMC4MDL_P4MDLPOL_LENGTH                 equ 0001h
PSMC4MDL_P4MDLPOL_MASK                   equ 0040h
PSMC4MDL_P4MDLEN_POSN                    equ 0007h
PSMC4MDL_P4MDLEN_POSITION                equ 0007h
PSMC4MDL_P4MDLEN_SIZE                    equ 0001h
PSMC4MDL_P4MDLEN_LENGTH                  equ 0001h
PSMC4MDL_P4MDLEN_MASK                    equ 0080h
PSMC4MDL_P4MSRC0_POSN                    equ 0000h
PSMC4MDL_P4MSRC0_POSITION                equ 0000h
PSMC4MDL_P4MSRC0_SIZE                    equ 0001h
PSMC4MDL_P4MSRC0_LENGTH                  equ 0001h
PSMC4MDL_P4MSRC0_MASK                    equ 0001h
PSMC4MDL_P4MSRC1_POSN                    equ 0001h
PSMC4MDL_P4MSRC1_POSITION                equ 0001h
PSMC4MDL_P4MSRC1_SIZE                    equ 0001h
PSMC4MDL_P4MSRC1_LENGTH                  equ 0001h
PSMC4MDL_P4MSRC1_MASK                    equ 0002h
PSMC4MDL_P4MSRC2_POSN                    equ 0002h
PSMC4MDL_P4MSRC2_POSITION                equ 0002h
PSMC4MDL_P4MSRC2_SIZE                    equ 0001h
PSMC4MDL_P4MSRC2_LENGTH                  equ 0001h
PSMC4MDL_P4MSRC2_MASK                    equ 0004h
PSMC4MDL_P4MSRC3_POSN                    equ 0003h
PSMC4MDL_P4MSRC3_POSITION                equ 0003h
PSMC4MDL_P4MSRC3_SIZE                    equ 0001h
PSMC4MDL_P4MSRC3_LENGTH                  equ 0001h
PSMC4MDL_P4MSRC3_MASK                    equ 0008h

// Register: PSMC4SYNC
#define PSMC4SYNC PSMC4SYNC
PSMC4SYNC                                equ 0F13h
// bitfield definitions
PSMC4SYNC_P4SYNC0_POSN                   equ 0000h
PSMC4SYNC_P4SYNC0_POSITION               equ 0000h
PSMC4SYNC_P4SYNC0_SIZE                   equ 0001h
PSMC4SYNC_P4SYNC0_LENGTH                 equ 0001h
PSMC4SYNC_P4SYNC0_MASK                   equ 0001h
PSMC4SYNC_P4SYNC1_POSN                   equ 0001h
PSMC4SYNC_P4SYNC1_POSITION               equ 0001h
PSMC4SYNC_P4SYNC1_SIZE                   equ 0001h
PSMC4SYNC_P4SYNC1_LENGTH                 equ 0001h
PSMC4SYNC_P4SYNC1_MASK                   equ 0002h
PSMC4SYNC_P4SYNC2_POSN                   equ 0002h
PSMC4SYNC_P4SYNC2_POSITION               equ 0002h
PSMC4SYNC_P4SYNC2_SIZE                   equ 0001h
PSMC4SYNC_P4SYNC2_LENGTH                 equ 0001h
PSMC4SYNC_P4SYNC2_MASK                   equ 0004h
PSMC4SYNC_P4DCPOL_POSN                   equ 0005h
PSMC4SYNC_P4DCPOL_POSITION               equ 0005h
PSMC4SYNC_P4DCPOL_SIZE                   equ 0001h
PSMC4SYNC_P4DCPOL_LENGTH                 equ 0001h
PSMC4SYNC_P4DCPOL_MASK                   equ 0020h
PSMC4SYNC_P4PRPOL_POSN                   equ 0006h
PSMC4SYNC_P4PRPOL_POSITION               equ 0006h
PSMC4SYNC_P4PRPOL_SIZE                   equ 0001h
PSMC4SYNC_P4PRPOL_LENGTH                 equ 0001h
PSMC4SYNC_P4PRPOL_MASK                   equ 0040h
PSMC4SYNC_P4POFST_POSN                   equ 0007h
PSMC4SYNC_P4POFST_POSITION               equ 0007h
PSMC4SYNC_P4POFST_SIZE                   equ 0001h
PSMC4SYNC_P4POFST_LENGTH                 equ 0001h
PSMC4SYNC_P4POFST_MASK                   equ 0080h

// Register: PSMC4CLK
#define PSMC4CLK PSMC4CLK
PSMC4CLK                                 equ 0F14h
// bitfield definitions
PSMC4CLK_P4CSRC0_POSN                    equ 0000h
PSMC4CLK_P4CSRC0_POSITION                equ 0000h
PSMC4CLK_P4CSRC0_SIZE                    equ 0001h
PSMC4CLK_P4CSRC0_LENGTH                  equ 0001h
PSMC4CLK_P4CSRC0_MASK                    equ 0001h
PSMC4CLK_P4CSRC1_POSN                    equ 0001h
PSMC4CLK_P4CSRC1_POSITION                equ 0001h
PSMC4CLK_P4CSRC1_SIZE                    equ 0001h
PSMC4CLK_P4CSRC1_LENGTH                  equ 0001h
PSMC4CLK_P4CSRC1_MASK                    equ 0002h
PSMC4CLK_P4CPRE0_POSN                    equ 0004h
PSMC4CLK_P4CPRE0_POSITION                equ 0004h
PSMC4CLK_P4CPRE0_SIZE                    equ 0001h
PSMC4CLK_P4CPRE0_LENGTH                  equ 0001h
PSMC4CLK_P4CPRE0_MASK                    equ 0010h
PSMC4CLK_P4CPRE1_POSN                    equ 0005h
PSMC4CLK_P4CPRE1_POSITION                equ 0005h
PSMC4CLK_P4CPRE1_SIZE                    equ 0001h
PSMC4CLK_P4CPRE1_LENGTH                  equ 0001h
PSMC4CLK_P4CPRE1_MASK                    equ 0020h
PSMC4CLK_P4CSRC_POSN                     equ 0000h
PSMC4CLK_P4CSRC_POSITION                 equ 0000h
PSMC4CLK_P4CSRC_SIZE                     equ 0002h
PSMC4CLK_P4CSRC_LENGTH                   equ 0002h
PSMC4CLK_P4CSRC_MASK                     equ 0003h
PSMC4CLK_P4CPRE_POSN                     equ 0004h
PSMC4CLK_P4CPRE_POSITION                 equ 0004h
PSMC4CLK_P4CPRE_SIZE                     equ 0002h
PSMC4CLK_P4CPRE_LENGTH                   equ 0002h
PSMC4CLK_P4CPRE_MASK                     equ 0030h

// Register: PSMC4OEN
#define PSMC4OEN PSMC4OEN
PSMC4OEN                                 equ 0F15h
// bitfield definitions
PSMC4OEN_P4OEA_POSN                      equ 0000h
PSMC4OEN_P4OEA_POSITION                  equ 0000h
PSMC4OEN_P4OEA_SIZE                      equ 0001h
PSMC4OEN_P4OEA_LENGTH                    equ 0001h
PSMC4OEN_P4OEA_MASK                      equ 0001h
PSMC4OEN_P4OEB_POSN                      equ 0001h
PSMC4OEN_P4OEB_POSITION                  equ 0001h
PSMC4OEN_P4OEB_SIZE                      equ 0001h
PSMC4OEN_P4OEB_LENGTH                    equ 0001h
PSMC4OEN_P4OEB_MASK                      equ 0002h

